Autodesk.Revit.DB.AnnotationLabel.IsValidParameterFormatting(Autodesk.Revit.DB.Document,System.Collections.Generic.IList{Autodesk.Revit.DB.AnnotationLabelParameterFormatting})
Checks the collection of parameter formatting objects is valid.
document:
The document that owns the annotation label.
parameterFormatting:
The parameter formatting objects to validate.
Returns:
True if the parameter formatting objects are valid, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027

Autodesk.Revit.DB.AnnotationLabel.SetParameterFormatting(System.Collections.Generic.IList{Autodesk.Revit.DB.AnnotationLabelParameterFormatting})
Sets the parameters seen in the annotation label.
Remarks:
The order of parameters in the input collection is the order in which parameters appear in the label.
parameterFormatting:
The ordered collection of parameter formatting objects to set.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The parameter formatting objects are invalid.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027

Autodesk.Revit.DB.AnnotationLabel.GetParamIds
Returns the ids of the parameters shown in the label.
Since:
2027

Autodesk.Revit.DB.AnnotationLabel.CanCreateAnnotationLabels(Autodesk.Revit.DB.Document)
Checks if the document can support creation of annotation labels.
Remarks:
Annotation labels may be created in annotation families.
document:
The document.
Returns:
True if the document supports creation of annotation labels, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027

Autodesk.Revit.DB.AnnotationLabel.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.XYZ,System.Collections.Generic.IList{Autodesk.Revit.DB.AnnotationLabelParameterFormatting},Autodesk.Revit.DB.ElementId)
Creates a new annotation label element with the given properties.
Remarks:
The new annotation label will use centered text alignment and centered text justification.
document:
A valid Revit document that is currently modifiable (i.e. with an open transaction).
viewId:
Id of the view in which the annotation label will be created.
position:
A model position of the new annotation label.
parameterFormatting:
The ordered collection of parameters with formatting to show in the annotation label.
typeId:
Id of the type to use for the new annotation label.
Returns:
The newly created annotation label.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document is not a family document.
-or-
The document does not support creation of annotation labels.
-or-
The parameter formatting objects are invalid.
-or-
The document is a family that cannot contain text notes or annotation labels.
-or-
The viewId does not represent a valid graphic view element in the given document.
-or-
The typeId does not represent a valid text type in the given document.
-or-
A valid point must not be father then 10 miles (approx. 16 km) from the origin.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027

Autodesk.Revit.DB.AnnotationLabel.GetParameterFormatting
Gets the collection of parameter formatting objects for the parameters seen in the label.
Remarks:
The parameters are returned in the order they are shown in the label.
Returns:
The collection of parameter formatting objects for the parameters seen in the label.
Since:
2027

Autodesk.Revit.DB.AnnotationLabel.UseNonBreakingSpaces
If non-breaking spaces should be used in the label text.
Remarks:
Set use non-breaking spaces to true if you want to
control the text wrapping yourself.
Since:
2027

Autodesk.Revit.DB.AnnotationLabel
Represents the label elements in annotation families.  Labels are used to display parameter values as text.
Since:
2027